# BuiltInFailures.ComponentRepeaterSlotFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ComponentRepeaterSlotFailures Class
BuiltInFailures Class Members See Also
---
Failures related to component repeater slots.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ComponentRepeaterSlotFailures
```

Visual Basic
---
```text
Public NotInheritable Class ComponentRepeaterSlotFailures
```

Visual C++
---
```text
public ref class ComponentRepeaterSlotFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ComponentRepeaterSlotFailures
# See Also
BuiltInFailures..::..ComponentRepeaterSlotFailures Members
Autodesk.Revit.DB Namespace